SELECT *
FROM sql.kinopoisk

SELECT movie_title, year, rating
FROM sql.kinopoisk

SELECT
    movie_title,
    2020 - year,
    rating
FROM sql.kinopoisk

SELECT
    director,
    movie_title,
    10 - rating AS difference
FROM sql.kinopoisk

SELECT
    director,
    movie_title,
    rating*10
FROM sql.kinopoisk

SELECT
    movie_title,
    year / rating
FROM sql.kinopoisk

SELECT *
FROM sql.kinopoisk
WHERE position = 1

SELECT *
FROM sql.kinopoisk
WHERE year = 1999

SELECT
    position,
    movie_title,
    year,
    director
FROM sql.kinopoisk
WHERE year < 1984

SELECT *
FROM sql.kinopoisk
WHERE year <> 2000

SELECT *
FROM sql.kinopoisk 
WHERE year >= 2000
AND rating >= 8

SELECT *
FROM sql.kinopoisk
WHERE year >= 1975
    AND year <= 1985

SELECT *
FROM sql.kinopoisk
WHERE year BETWEEN 1975 AND 1985

SELECT
    director,
    movie_title
FROM sql.kinopoisk
WHERE rating >= 8.5

SELECT *
FROM sql.kinopoisk
WHERE year NOT BETWEEN 1965 AND 1980

SELECT
    year,
    movie_title,
    director
FROM sql.kinopoisk
WHERE (rating > 8.5 AND year < 2000)
    OR year >= 2000

SELECT
    movie_title
FROM sql.kinopoisk
WHERE year IN (2000, 1985, 1939)

SELECT *
FROM sql.kinopoisk
WHERE director = 'Леонид Гайдай'

SELECT *
FROM sql.kinopoisk
WHERE movie_title LIKE 'А%'

SELECT
    movie_title,
    year
FROM sql.kinopoisk
WHERE director LIKE 'Дэвид%' AND rating > 8

SELECT *
FROM sql.kinopoisk
WHERE overview IS NULL

Сортировка

SELECT *
FROM sql.kinopoisk
ORDER BY movie_title

SELECT *
FROM sql.kinopoisk
ORDER BY rating

SELECT
    movie_title,
    director,
    screenwriter,
    year
FROM sql.kinopoisk
WHERE country = 'СССР'
ORDER BY rating DESC

SELECT
    movie_title,
    rating,
    overview,
    year
FROM sql.kinopoisk
ORDER BY overview

SELECT
    director,
    movie_title
FROM sql.kinopoisk
ORDER BY year, rating DESC

SELECT
    director,
    movie_title,
    year
FROM sql.kinopoisk
ORDER BY 1, 3 DESC

SELECT *
FROM sql.kinopoisk
LIMIT 10

SELECT
    movie_title,
    rating
FROM sql.kinopoisk 
ORDER BY rating DESC
LIMIT 5

Агрегатные функции

sql.pokemon
id	уникальный идентификатор
name	имя
type1	основной тип
type2	дополнительный тип
hp	количество очков здоровья
attack	показатели атаки
defense	показатели защиты
speed	показатели скорости

SELECT DISTINCT
    type1
FROM sql.pokemon

SELECT DISTINCT
    type1,
    type2
FROM sql.pokemon

In [ ]:
SELECT
    COUNT(*)
FROM sql.pokemon
#COUNT считает строки, а звёздочка (*) в аргументе функции означает, что считаются все строки, которые возвращает запрос.
#Если в аргументе функции указать название столбца, функция обработает только строки с непустым значением.

In [ ]:
SELECT
    COUNT(type2)
FROM sql.pokemon

In [ ]:
SELECT
    COUNT(DISTINCT type1)
FROM sql.pokemon

In [ ]:
SELECT
    COUNT(*) AS "всего травяных покемонов",
    COUNT(type2) AS "покемонов с дополнительным типом",
    AVG(attack) AS "средняя атака",
    AVG(defense) AS "средняя защита"
FROM sql.pokemon
WHERE type1 = 'Grass'

In [ ]:
SELECT
    type1 AS pokemon_type,
    COUNT(*) AS pokemon_count
FROM sql.pokemon
GROUP BY type1
ORDER BY type1

In [ ]:
SELECT
    type1 AS pokemon_type,
    COUNT(*) AS pokemon_count
FROM sql.pokemon
GROUP BY pokemon_type
ORDER BY COUNT(*) DESC

In [ ]:
SELECT
    type1 AS primary_type,
    type2 AS additional_type,
    COUNT(*) AS pokemon_count
FROM sql.pokemon
GROUP BY 1, 2
ORDER BY 1, 2 NULLS FIRST

In [ ]:
SELECT
    type1 AS primary_type,
    AVG(attack) AS avg_attack
FROM sql.pokemon
GROUP BY primary_type 
HAVING AVG(attack) > 90

In [ ]:
SELECT
    type1 AS primary_type
FROM sql.pokemon
GROUP BY primary_type 
HAVING AVG(attack) > 90
#Выведет те же типы покемонов как и в ячейке вышеЮ, но без данных о средней атаки (Но она будет >90)

In [ ]:
#Общий вид оператора SELECT
SELECT [ALL | DISTINCT] список_столбцов|*
FROM список_имён_таблиц
[WHERE условие_поиска]
[GROUP BY список_имён_столбцов]
[HAVING условие_поиска]
[ORDER BY имя_столбца [ASC | DESC],…]

In [ ]:
SELECT
    столбец1 AS новое_название,
    столбец2,
    АГРЕГАТ(столбец3)
FROM таблица
WHERE (условие1 OR условие2)
    AND условие3
GROUP BY столбец1, столбец2
HAVING АГРЕГАТ(столбец3) > 5
ORDER BY сортировка1, сортировка2
OFFSET 1 LIMIT 2

Объединение таблиц

Данные


Таблица teams

id	id команды

api_id	ключ на таблицу matches

long_name	полное название команды

short_name	сокращённое название команды

/

Таблица matches

id	id матча

season	сезон

date	дата матча

home_team_api_id	api_id домашней команды, ключ на таблицу teams

away_team_api_id	api_id гостевой команды, ключ на таблицу teams

home_team_goals	количество голов домашней команды

away_team_goals	количество голов гостевой команды

In [ ]:
SELECT *
FROM
    sql.teams,
    sql.matches
#Будет выполнено декартовое произведение таблиц

In [ ]:
SELECT 
    long_name, 
    home_team_goals,
    away_team_goals
FROM
    sql.teams,
    sql.matches
WHERE home_team_api_id = api_id

In [ ]:
SELECT 
    long_name,
    home_team_goals,
    away_team_goals
FROM    
    sql.teams
JOIN sql.matches on home_team_api_id = api_id

In [ ]:
SELECT
    teams.id
FROM 
    sql.teams
JOIN sql.matches ON home_team_api_id = api_id

In [ ]:
SELECT
    matches.id
FROM 
    sql.teams
JOIN sql.matches on home_team_api_id = api_id

In [ ]:
SELECT
    h.long_name "домашняя команда",
    m.home_team_goals "голы домашней команды",
    m.away_team_goals "голы гостевой команды",
    a.long_name "гостевая команда" 
FROM
    sql.matches m
    JOIN sql.teams h ON m.home_team_api_id = h.api_id
    JOIN sql.teams a ON m.away_team_api_id = a.api_id

In [ ]:
SELECT 
    m.id
FROM
    sql.teams t
    JOIN sql.matches m ON m.away_team_api_id = t.api_id
WHERE long_name = 'Arsenal'

In [ ]:
SELECT 
	m.id id_1,
	m.season,
	t.id id_2,
	t.long_name
FROM
	sql.teams t
JOIN sql.matches m ON m.away_team_api_id = t.api_id

In [ ]:
SELECT *
FROM    
    sql.matches m
    JOIN sql.teams t on t.api_id = m.home_team_api_id
WHERE
    t.short_name = 'GEN'
    AND m.season = '2008/2009'

In [ ]:
SELECT
    t.long_name,
    SUM(m.home_team_goals) + SUM(m.away_team_goals) match_goals
FROM
    sql.matches m
    JOIN sql.teams t ON m.away_team_api_id = t.api_id 
GROUP BY t.id

In [ ]:
SELECT
    m.season,
    SUM(m.home_team_goals) + SUM(m.away_team_goals) total_goals
FROM sql.matches m
GROUP BY m.season

In [ ]:
SELECT
    m.season,
    t.long_name,
    SUM(m.home_team_goals) + SUM(m.away_team_goals) total_goals
FROM sql.matches m
JOIN sql.teams t ON t.api_id = m.home_team_api_id OR t.api_id = m.away_team_api_id
GROUP BY m.season, t.id
HAVING SUM(m.home_team_goals) + SUM(m.away_team_goals) > 100

In [ ]:
SELECT
    t.long_name,
    m.id
FROM sql.teams t
LEFT JOIN sql.matches m ON t.api_id = m.home_team_api_id OR t.api_id = m.away_team_api_id
ORDER BY m.id DESC

In [ ]:
SELECT
    t.long_name
FROM 
    sql.teams t
LEFT JOIN sql.matches m ON t.api_id = m.home_team_api_id OR t.api_id = m.away_team_api_id
WHERE m.id IS NULL

In [ ]:
SELECT
    t.long_name,
    SUM(m.away_team_goals) total_goals
FROM   
    sql.teams t
LEFT JOIN sql.matches m ON t.api_id = m.away_team_api_id
GROUP BY t.id
ORDER BY 2 DESC

In [ ]:
SELECT *
FROM
    sql.teams
    CROSS JOIN sql.matches

In [ ]:
SELECT *
FROM
    sql.teams
    JOIN sql.matches ON TRUE

In [ ]:
SELECT
    DISTINCT
    t1.long_name home_team, 
    t2.long_name away_team
FROM
    sql.teams t1
    CROSS JOIN sql.teams t2

In [ ]:
SELECT 
…
FROM 
         table1 
NATURAL JOIN table2

Данные

Интересующие нас данные хранятся в таблицах city, customer, driver, shipment, truck.

Таблица city — это справочник городов.

Таблица customer — это справочник клиентов.

Следующая таблица — driver — справочник водителей. 

В таблице truck хранится информация о грузовиках, на которых осуществляются перевозки. 

Последняя таблица в датасете, shipment, — таблица с данными непосредственно о доставках. Она описывает взаимодействие всех перечисленных сущностей, а потому содержит наибольшее количество ссылок на другие таблицы.

In [ ]:
SELECT
         c.city_id object_name, 'id города' object_type
FROM 
         sql.city c

UNION ALL

SELECT
         d.driver_id other_name, 'id водителя' other_type
FROM 
         sql.driver d

UNION ALL

SELECT
         s.ship_id, 'id доставки'
FROM 
         sql.shipment s

UNION ALL

SELECT
         c.cust_id, 'id клиента'
FROM 
         sql.customer c

UNION ALL

SELECT
         t.truck_id, 'id грузовика'
FROM 
         sql.truck t
ORDER BY 1

In [ ]:
(SELECT book_name object_name, 'книга' object_descritption 
FROM public.books
ORDER BY 1
LIMIT 1)
UNION ALL
(SELECT movie_title, 'фильм' 
FROM sql.kinopoisk
ORDER BY 1
LIMIT 1)

In [ ]:
SELECT 
         c.city_id::text
FROM
         sql.city c

UNION ALL

SELECT 
         cc.city_name
FROM
         sql.city cc

In [ ]:
SELECT
         c.city_name,
         c.population
FROM
         sql.city c

UNION ALL

SELECT
         'total',
         SUM(c.population)
FROM
         sql.city c
ORDER BY 2 DESC

In [ ]:
SELECT
         d.first_name,
         d.last_name,
         'телефон заполнен' phone_info
FROM
         sql.driver d
WHERE d.phone IS NOT NULL

UNION

SELECT
         d.first_name,
         d.last_name,
         'телефон не заполнен' phone_info
FROM
         sql.driver d
WHERE d.phone IS NULL

In [ ]:
SELECT 
         'a' letter,'1' ordinal_position

UNION 

SELECT 
         'b','2'

UNION 

SELECT
         'c','3'

In [ ]:
SELECT 1000000 number
UNION
SELECT 541
UNION
SELECT -500
UNION
SELECT 100
ORDER BY number DESC
LIMIT 1

In [ ]:
SELECT
         c.city_name
FROM
         sql.shipment s
JOIN sql.city c ON s.city_id = c.city_id

EXCEPT

SELECT
         cc.city_name
FROM
         sql.driver d 
JOIN sql.city cc ON d.city_id=cc.city_id
ORDER BY 1

In [ ]:
SELECT 
         c.city_name object_name
FROM 
         sql.city c

INTERSECT

SELECT 
         cc.state
FROM 
         sql.city cc
ORDER BY 1

In [ ]:
(select 
c.city_name,
s.weight
from sql.shipment s
join sql.city c ON s.city_id=c.city_id 
order by weight desc
limit 1)
union all
(select 
c.city_name,
s.weight
from sql.shipment s
join sql.city c ON s.city_id=c.city_id 
order by weight
limit 1)

In [ ]:
select cust_id mutual_id
from sql.customer
intersect
select ship_id
from sql.shipment
order by mutual_id

In [ ]:
select cust_name object_name,
'КЛИЕНТ' object_description
from sql.customer
where cust_type='manufacturer'
union
select make,
'ГРУЗОВИК'
from sql.truck
order by object_name

Типы данных

In [ ]:
SELECT CURRENT_TIMESTAMP

In [ ]:
SELECT NOW()

In [ ]:
show timezone

In [ ]:
select now() at time zone 'Europe/Moscow'

In [ ]:
select CURRENT_DATE

In [ ]:
select now()::date

In [ ]:
with x as 
(
select '2018-12-31 21:00:00+00'::timestamp with time zone ts
)
select (ts at time zone 'Europe/Moscow')::date as dt_msk,
(ts at time zone 'UTC')::date as dt_utc
from x

In [ ]:
select extract (year from ship_date) year_n,
extract (month from ship_date) month_n,
count(ship_id) qty
from sql.shipment
group by year_n, month_n
order by year_n, month_n

In [ ]:
select to_char(now(),'"Hello! Today is" DAY yyyy-Mon-dd')

In [ ]:
select date_trunc('minute',now())

In [ ]:
select (date_trunc('quarter', ship_date))::date q,
SUM(weight)  total_weight
from sql.shipment
group by q
order by q

In [ ]:
select '2019-01-01'::date + 10

In [ ]:
select '2019-02-10'::date - '2017-03-01'::date

In [ ]:
select c.city_name,
(max(s.ship_date) - min(s.ship_date)) days_active
from sql.shipment s
left join sql.city c on s.city_id=c.city_id
group by city_name
order by city_name, days_active

In [ ]:
select 'select * from '||t.table_schema||'.'||t.table_name||';' query
from information_schema.tables t
where table_schema = 'shipping'

In [ ]:
select ('Ваш заказ доставит водитель '||first_name||' '||last_name||'. Его контактный номер: '||COALESCE(phone,'-')) AS msg
from sql.driver

In [ ]:
select c.cust_id,
lower(c.cust_name) cust_name
from sql.shipment s
left join sql.customer c on s.cust_id=c.cust_id
group by 1
having count(s.ship_id) > 10
order by 1

In [ ]:
select replace('малако','а','о')

In [ ]:
select replace('Hello, world!',', world','')

In [ ]:
SELECT
    lower(replace(state, ' ','_'))||'__'||lower(replace(city_name,' ','_')) utm
FROM sql.city
ORDER BY 1

In [ ]:
with t as
(
select 'Один два три'::text sample_string
)
select 
 left(t.sample_string,4) one,
 right(left(t.sample_string,8),3) two,
 right(t.sample_string,3) three
from t

In [ ]:
select
     left(c.state, 4) code,
     count(distinct (c.state, 4)) qty
from
    sql.city c
group by 1
having count(distinct (c.state, 4))>1

In [ ]:
select format('driver_id = %s, first_name = %s, last_name = %s, address = %s, zip_code = %s, phone = %s, city_id = %s', 
              driver_id, first_name, last_name, address, zip_code, phone, city_id) from shipping.driver d

In [ ]:
SELECT
   FORMAT($$%s is located in %s. There's %s people living there. Its area is %s$$,city_name,state,population,area) AS str
FROM sql.city
ORDER BY city_name